[
    {
        "title": "Senior Site Reliability Engineer",
        "company": "GE Digital",
        "start": "February 2019",
        "end": "",
        "logo": "general_electric.png",
        "description": "In this role, I was given much more responsbility. I transferred sole ownership of the monitoring platform over to engineers new to the team. Operational and maintenence work was still my responsibility, I had enough free time to build out an event pipeline for all of the monitoring events. Using the skills I learned from my previous role, I made sure that I had full visibility into the availability, reliability and any errors for the platform; so much that I was able to see front-facing errors before or at the same time the connected applications saw errors."
    },
    {
        "title": "Lifecycle Operations Engineer",
        "company": "GE Digital",
        "start": "December 2017",
        "end": "February 2019",
        "logo": "general_electric.png",
        "description": "In this role I was first introduced to monitoring and metrics. I focused efforts to automate mundane tasks that were common and shaved off days worth of work into a few minutes of time. While still learning the systems, I refactored many codebases to be more readable, less redundant and optimized. I took the monitoring platform availability from ~80% up to 99.99998%. Through metrics and monitoring the platform itself, I was able to accurately determine my availability."
    },
    {
        "title": "Software Engineer",
        "company": "Classified",
        "start": "May 2015",
        "end": "December 2017",
        "logo": "top_secret.png",
        "description": "The stuff I worked on was top secret. I wish I could show you all of the really cool complex things I did, but that wouldn't be safe for you nor myself."
    },
    {
        "title": "Programming/IT Tutor",
        "company": "Georgia Gwinnett College",
        "start": "August 2013",
        "end": "May 2015",
        "logo": "georgia_gwinnett.png",
        "description": "In this role, I learned the ins and outs of fundamental object-oriented programming. Aftering taking advanded java programming, I went back and talked to a professor that I knew well, and she allowed me to sit in on her class. I made sure I understood every concept and was not just going through the motion."
    }
]